const createDir = require('./').createDir
const batchTesk = async () => {
    let queue = [
        ['北京市', 110000, 1, 3e3],
        ['天津市', 120000, 1, 3e3],
        ['上海市', 310000, 1, 3e3],
        ['重庆市', 500000, 1, 3e3],

        // ['广东省', 440000, 1, 0],
        // ['江苏省', 320000, 1, 0],
        // ['浙江省', 330000, 1, 0],
        // ['山东省', 370000, 1, 0],
        // ['河南省', 410000, 1, 0],
        // ['四川省', 510000, 1, 0],
        // ['福建省', 350000, 1, 0],

        // ['杭州市', 330100, 0, 0],
        // ['厦门市', 350200, 0, 0],
        // ['郑州市', 410100, 0, 0],
        // ['武汉市', 420100, 0, 0],
        // ['广州市', 440100, 0, 0],
        // ['深圳市', 440300, 0, 0],
        // ['成都市', 510100, 0, 0],

    ];
    await Promise.all(queue.map(async item => await createDir(item)));
    process.exit(0);
}
batchTesk();